Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/tcc.h
/*
 * Component description for TCC
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2024-06-28T20:38:26Z */
#ifndef _PIC32CZCA90_TCC_COMPONENT_H_
#define _PIC32CZCA90_TCC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR TCC                                          */
/* ************************************************************************** */

/* -------- TCC_CTRLA : (TCC Offset: 0x00) (R/W 32) Control A -------- */
#define TCC_CTRLA_RESETVALUE                  _UINT32_(0x00)                                       /*  (TCC_CTRLA) Control A  Reset Value */

#define TCC_CTRLA_SWRST_Pos                   _UINT32_(0)                                          /* (TCC_CTRLA) Software Reset Position */
#define TCC_CTRLA_SWRST_Msk                   (_UINT32_(0x1) << TCC_CTRLA_SWRST_Pos)               /* (TCC_CTRLA) Software Reset Mask */
#define TCC_CTRLA_SWRST(value)                (TCC_CTRLA_SWRST_Msk & (_UINT32_(value) << TCC_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the TCC_CTRLA register */
#define TCC_CTRLA_ENABLE_Pos                  _UINT32_(1)                                          /* (TCC_CTRLA) Enable Position */
#define TCC_CTRLA_ENABLE_Msk                  (_UINT32_(0x1) << TCC_CTRLA_ENABLE_Pos)              /* (TCC_CTRLA) Enable Mask */
#define TCC_CTRLA_ENABLE(value)               (TCC_CTRLA_ENABLE_Msk & (_UINT32_(value) << TCC_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the TCC_CTRLA register */
#define TCC_CTRLA_RESOLUTION_Pos              _UINT32_(5)                                          /* (TCC_CTRLA) Enhanced Resolution Position */
#define TCC_CTRLA_RESOLUTION_Msk              (_UINT32_(0x3) << TCC_CTRLA_RESOLUTION_Pos)          /* (TCC_CTRLA) Enhanced Resolution Mask */
#define TCC_CTRLA_RESOLUTION(value)           (TCC_CTRLA_RESOLUTION_Msk & (_UINT32_(value) << TCC_CTRLA_RESOLUTION_Pos)) /* Assigment of value for RESOLUTION in the TCC_CTRLA register */
#define   TCC_CTRLA_RESOLUTION_NONE_Val       _UINT32_(0x0)                                        /* (TCC_CTRLA) Dithering is disabled  */
#define   TCC_CTRLA_RESOLUTION_DITH4_Val      _UINT32_(0x1)                                        /* (TCC_CTRLA) Dithering is done every 16 PWM frames  */
#define   TCC_CTRLA_RESOLUTION_DITH5_Val      _UINT32_(0x2)                                        /* (TCC_CTRLA) Dithering is done every 32 PWM frames  */
#define   TCC_CTRLA_RESOLUTION_DITH6_Val      _UINT32_(0x3)                                        /* (TCC_CTRLA) Dithering is done every 64 PWM frames  */
#define TCC_CTRLA_RESOLUTION_NONE             (TCC_CTRLA_RESOLUTION_NONE_Val << TCC_CTRLA_RESOLUTION_Pos) /* (TCC_CTRLA) Dithering is disabled Position  */
#define TCC_CTRLA_RESOLUTION_DITH4            (TCC_CTRLA_RESOLUTION_DITH4_Val << TCC_CTRLA_RESOLUTION_Pos) /* (TCC_CTRLA) Dithering is done every 16 PWM frames Position  */
#define TCC_CTRLA_RESOLUTION_DITH5            (TCC_CTRLA_RESOLUTION_DITH5_Val << TCC_CTRLA_RESOLUTION_Pos) /* (TCC_CTRLA) Dithering is done every 32 PWM frames Position  */
#define TCC_CTRLA_RESOLUTION_DITH6            (TCC_CTRLA_RESOLUTION_DITH6_Val << TCC_CTRLA_RESOLUTION_Pos) /* (TCC_CTRLA) Dithering is done every 64 PWM frames Position  */
#define TCC_CTRLA_PRESCALER_Pos               _UINT32_(8)                                          /* (TCC_CTRLA) Prescaler Position */
#define TCC_CTRLA_PRESCALER_Msk               (_UINT32_(0x7) << TCC_CTRLA_PRESCALER_Pos)           /* (TCC_CTRLA) Prescaler Mask */
#define TCC_CTRLA_PRESCALER(value)            (TCC_CTRLA_PRESCALER_Msk & (_UINT32_(value) << TCC_CTRLA_PRESCALER_Pos)) /* Assigment of value for PRESCALER in the TCC_CTRLA register */
#define   TCC_CTRLA_PRESCALER_DIV1_Val        _UINT32_(0x0)                                        /* (TCC_CTRLA) No division  */
#define   TCC_CTRLA_PRESCALER_DIV2_Val        _UINT32_(0x1)                                        /* (TCC_CTRLA) Divide by 2  */
#define   TCC_CTRLA_PRESCALER_DIV4_Val        _UINT32_(0x2)                                        /* (TCC_CTRLA) Divide by 4  */
#define   TCC_CTRLA_PRESCALER_DIV8_Val        _UINT32_(0x3)                                        /* (TCC_CTRLA) Divide by 8  */
#define   TCC_CTRLA_PRESCALER_DIV16_Val       _UINT32_(0x4)                                        /* (TCC_CTRLA) Divide by 16  */
#define   TCC_CTRLA_PRESCALER_DIV64_Val       _UINT32_(0x5)                                        /* (TCC_CTRLA) Divide by 64  */
#define   TCC_CTRLA_PRESCALER_DIV256_Val      _UINT32_(0x6)                                        /* (TCC_CTRLA) Divide by 256  */
#define   TCC_CTRLA_PRESCALER_DIV1024_Val     _UINT32_(0x7)                                        /* (TCC_CTRLA) Divide by 1024  */
#define TCC_CTRLA_PRESCALER_DIV1              (TCC_CTRLA_PRESCALER_DIV1_Val << TCC_CTRLA_PRESCALER_Pos) /* (TCC_CTRLA) No division Position  */
#define TCC_CTRLA_PRESCALER_DIV2              (TCC_CTRLA_PRESCALER_DIV2_Val << TCC_CTRLA_PRESCALER_Pos) /* (TCC_CTRLA) Divide by 2 Position  */
#define TCC_CTRLA_PRESCALER_DIV4              (TCC_CTRLA_PRESCALER_DIV4_Val << TCC_CTRLA_PRESCALER_Pos) /* (TCC_CTRLA) Divide by 4 Position  */
#define TCC_CTRLA_PRESCALER_DIV8              (TCC_CTRLA_PRESCALER_DIV8_Val << TCC_CTRLA_PRESCALER_Pos) /* (TCC_CTRLA) Divide by 8 Position  */
#define TCC_CTRLA_PRESCALER_DIV16             (TCC_CTRLA_PRESCALER_DIV16_Val << TCC_CTRLA_PRESCALER_Pos) /* (TCC_CTRLA) Divide by 16 Position  */
#define TCC_CTRLA_PRESCALER_DIV64             (TCC_CTRLA_PRESCALER_DIV64_Val << TCC_CTRLA_PRESCALER_Pos) /* (TCC_CTRLA) Divide by 64 Position  */
#define TCC_CTRLA_PRESCALER_DIV256            (TCC_CTRLA_PRESCALER_DIV256_Val << TCC_CTRLA_PRESCALER_Pos) /* (TCC_CTRLA) Divide by 256 Position  */
#define TCC_CTRLA_PRESCALER_DIV1024           (TCC_CTRLA_PRESCALER_DIV1024_Val << TCC_CTRLA_PRESCALER_Pos) /* (TCC_CTRLA) Divide by 1024 Position  */
#define TCC_CTRLA_RUNSTDBY_Pos                _UINT32_(11)                                         /* (TCC_CTRLA) Run in Standby Position */
#define TCC_CTRLA_RUNSTDBY_Msk                (_UINT32_(0x1) << TCC_CTRLA_RUNSTDBY_Pos)            /* (TCC_CTRLA) Run in Standby Mask */
#define TCC_CTRLA_RUNSTDBY(value)             (TCC_CTRLA_RUNSTDBY_Msk & (_UINT32_(value) << TCC_CTRLA_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the TCC_CTRLA register */
#define TCC_CTRLA_PRESCSYNC_Pos               _UINT32_(12)                                         /* (TCC_CTRLA) Prescaler and Counter Synchronization Selection Position */
#define TCC_CTRLA_PRESCSYNC_Msk               (_UINT32_(0x3) << TCC_CTRLA_PRESCSYNC_Pos)           /* (TCC_CTRLA) Prescaler and Counter Synchronization Selection Mask */
#define TCC_CTRLA_PRESCSYNC(value)            (TCC_CTRLA_PRESCSYNC_Msk & (_UINT32_(value) << TCC_CTRLA_PRESCSYNC_Pos)) /* Assigment of value for PRESCSYNC in the TCC_CTRLA register */
#define   TCC_CTRLA_PRESCSYNC_GCLK_Val        _UINT32_(0x0)                                        /* (TCC_CTRLA) Reload or reset counter on next GCLK  */
#define   TCC_CTRLA_PRESCSYNC_PRESC_Val       _UINT32_(0x1)                                        /* (TCC_CTRLA) Reload or reset counter on next prescaler clock  */
#define   TCC_CTRLA_PRESCSYNC_RESYNC_Val      _UINT32_(0x2)                                        /* (TCC_CTRLA) Reload or reset counter on next GCLK and reset prescaler counter  */
#define TCC_CTRLA_PRESCSYNC_GCLK              (TCC_CTRLA_PRESCSYNC_GCLK_Val << TCC_CTRLA_PRESCSYNC_Pos) /* (TCC_CTRLA) Reload or reset counter on next GCLK Position  */
#define TCC_CTRLA_PRESCSYNC_PRESC             (TCC_CTRLA_PRESCSYNC_PRESC_Val << TCC_CTRLA_PRESCSYNC_Pos) /* (TCC_CTRLA) Reload or reset counter on next prescaler clock Position  */
#define TCC_CTRLA_PRESCSYNC_RESYNC            (TCC_CTRLA_PRESCSYNC_RESYNC_Val << TCC_CTRLA_PRESCSYNC_Pos) /* (TCC_CTRLA) Reload or reset counter on next GCLK and reset prescaler counter Position  */
#define TCC_CTRLA_ALOCK_Pos                   _UINT32_(14)                                         /* (TCC_CTRLA) Auto Lock Position */
#define TCC_CTRLA_ALOCK_Msk                   (_UINT32_(0x1) << TCC_CTRLA_ALOCK_Pos)               /* (TCC_CTRLA) Auto Lock Mask */
#define TCC_CTRLA_ALOCK(value)                (TCC_CTRLA_ALOCK_Msk & (_UINT32_(value) << TCC_CTRLA_ALOCK_Pos)) /* Assigment of value for ALOCK in the TCC_CTRLA register */
#define TCC_CTRLA_MSYNC_Pos                   _UINT32_(15)                                         /* (TCC_CTRLA) Master Synchronization (only for TCC Slave Instance) Position */
#define TCC_CTRLA_MSYNC_Msk                   (_UINT32_(0x1) << TCC_CTRLA_MSYNC_Pos)               /* (TCC_CTRLA) Master Synchronization (only for TCC Slave Instance) Mask */
#define TCC_CTRLA_MSYNC(value)                (TCC_CTRLA_MSYNC_Msk & (_UINT32_(value) << TCC_CTRLA_MSYNC_Pos)) /* Assigment of value for MSYNC in the TCC_CTRLA register */
#define TCC_CTRLA_FCYCLE_Pos                  _UINT32_(16)                                         /* (TCC_CTRLA) Full Cycle Position */
#define TCC_CTRLA_FCYCLE_Msk                  (_UINT32_(0x1) << TCC_CTRLA_FCYCLE_Pos)              /* (TCC_CTRLA) Full Cycle Mask */
#define TCC_CTRLA_FCYCLE(value)               (TCC_CTRLA_FCYCLE_Msk & (_UINT32_(value) << TCC_CTRLA_FCYCLE_Pos)) /* Assigment of value for FCYCLE in the TCC_CTRLA register */
#define TCC_CTRLA_DMAOS_Pos                   _UINT32_(23)                                         /* (TCC_CTRLA) DMA One-shot Trigger Mode Position */
#define TCC_CTRLA_DMAOS_Msk                   (_UINT32_(0x1) << TCC_CTRLA_DMAOS_Pos)               /* (TCC_CTRLA) DMA One-shot Trigger Mode Mask */
#define TCC_CTRLA_DMAOS(value)                (TCC_CTRLA_DMAOS_Msk & (_UINT32_(value) << TCC_CTRLA_DMAOS_Pos)) /* Assigment of value for DMAOS in the TCC_CTRLA register */
#define TCC_CTRLA_CPTEN0_Pos                  _UINT32_(24)                                         /* (TCC_CTRLA) Capture Channel 0 Enable Position */
#define TCC_CTRLA_CPTEN0_Msk                  (_UINT32_(0x1) << TCC_CTRLA_CPTEN0_Pos)              /* (TCC_CTRLA) Capture Channel 0 Enable Mask */
#define TCC_CTRLA_CPTEN0(value)               (TCC_CTRLA_CPTEN0_Msk & (_UINT32_(value) << TCC_CTRLA_CPTEN0_Pos)) /* Assigment of value for CPTEN0 in the TCC_CTRLA register */
#define TCC_CTRLA_CPTEN1_Pos                  _UINT32_(25)                                         /* (TCC_CTRLA) Capture Channel 1 Enable Position */
#define TCC_CTRLA_CPTEN1_Msk                  (_UINT32_(0x1) << TCC_CTRLA_CPTEN1_Pos)              /* (TCC_CTRLA) Capture Channel 1 Enable Mask */
#define TCC_CTRLA_CPTEN1(value)               (TCC_CTRLA_CPTEN1_Msk & (_UINT32_(value) << TCC_CTRLA_CPTEN1_Pos)) /* Assigment of value for CPTEN1 in the TCC_CTRLA register */
#define TCC_CTRLA_CPTEN2_Pos                  _UINT32_(26)                                         /* (TCC_CTRLA) Capture Channel 2 Enable Position */
#define TCC_CTRLA_CPTEN2_Msk                  (_UINT32_(0x1) << TCC_CTRLA_CPTEN2_Pos)              /* (TCC_CTRLA) Capture Channel 2 Enable Mask */
#define TCC_CTRLA_CPTEN2(value)               (TCC_CTRLA_CPTEN2_Msk & (_UINT32_(value) << TCC_CTRLA_CPTEN2_Pos)) /* Assigment of value for CPTEN2 in the TCC_CTRLA register */
#define TCC_CTRLA_CPTEN3_Pos                  _UINT32_(27)                                         /* (TCC_CTRLA) Capture Channel 3 Enable Position */
#define TCC_CTRLA_CPTEN3_Msk                  (_UINT32_(0x1) << TCC_CTRLA_CPTEN3_Pos)              /* (TCC_CTRLA) Capture Channel 3 Enable Mask */
#define TCC_CTRLA_CPTEN3(value)               (TCC_CTRLA_CPTEN3_Msk & (_UINT32_(value) << TCC_CTRLA_CPTEN3_Pos)) /* Assigment of value for CPTEN3 in the TCC_CTRLA register */
#define TCC_CTRLA_CPTEN4_Pos                  _UINT32_(28)                                         /* (TCC_CTRLA) Capture Channel 4 Enable Position */
#define TCC_CTRLA_CPTEN4_Msk                  (_UINT32_(0x1) << TCC_CTRLA_CPTEN4_Pos)              /* (TCC_CTRLA) Capture Channel 4 Enable Mask */
#define TCC_CTRLA_CPTEN4(value)               (TCC_CTRLA_CPTEN4_Msk & (_UINT32_(value) << TCC_CTRLA_CPTEN4_Pos)) /* Assigment of value for CPTEN4 in the TCC_CTRLA register */
#define TCC_CTRLA_CPTEN5_Pos                  _UINT32_(29)                                         /* (TCC_CTRLA) Capture Channel 5 Enable Position */
#define TCC_CTRLA_CPTEN5_Msk                  (_UINT32_(0x1) << TCC_CTRLA_CPTEN5_Pos)              /* (TCC_CTRLA) Capture Channel 5 Enable Mask */
#define TCC_CTRLA_CPTEN5(value)               (TCC_CTRLA_CPTEN5_Msk & (_UINT32_(value) << TCC_CTRLA_CPTEN5_Pos)) /* Assigment of value for CPTEN5 in the TCC_CTRLA register */
#define TCC_CTRLA_CPTEN6_Pos                  _UINT32_(30)                                         /* (TCC_CTRLA) Capture Channel 6 Enable Position */
#define TCC_CTRLA_CPTEN6_Msk                  (_UINT32_(0x1) << TCC_CTRLA_CPTEN6_Pos)              /* (TCC_CTRLA) Capture Channel 6 Enable Mask */
#define TCC_CTRLA_CPTEN6(value)               (TCC_CTRLA_CPTEN6_Msk & (_UINT32_(value) << TCC_CTRLA_CPTEN6_Pos)) /* Assigment of value for CPTEN6 in the TCC_CTRLA register */
#define TCC_CTRLA_CPTEN7_Pos                  _UINT32_(31)                                         /* (TCC_CTRLA) Capture Channel 7 Enable Position */
#define TCC_CTRLA_CPTEN7_Msk                  (_UINT32_(0x1) << TCC_CTRLA_CPTEN7_Pos)              /* (TCC_CTRLA) Capture Channel 7 Enable Mask */
#define TCC_CTRLA_CPTEN7(value)               (TCC_CTRLA_CPTEN7_Msk & (_UINT32_(value) << TCC_CTRLA_CPTEN7_Pos)) /* Assigment of value for CPTEN7 in the TCC_CTRLA register */
#define TCC_CTRLA_Msk                         _UINT32_(0xFF81FF63)                                 /* (TCC_CTRLA) Register Mask  */

#define TCC_CTRLA_CPTEN_Pos                   _UINT32_(24)                                         /* (TCC_CTRLA Position) Capture Channel 7 Enable */
#define TCC_CTRLA_CPTEN_Msk                   (_UINT32_(0xFF) << TCC_CTRLA_CPTEN_Pos)              /* (TCC_CTRLA Mask) CPTEN */
#define TCC_CTRLA_CPTEN(value)                (TCC_CTRLA_CPTEN_Msk & (_UINT32_(value) << TCC_CTRLA_CPTEN_Pos)) 

